#დასასრულებლად:

#დავალება: შექმენით ოთხი მათემატიკური ფუნქცია, თითოეულს გადაეცით ორი არგუმენტი და სახელის შესაბამისად მოახდინეთ მუშაობა. ოპერაციები: +, -, *, /.

#დავალება2: შექმენით ფუნქცია, რომელსაც გადასცემთ მართკუთხედის სიგრძესა და სიმაღლეს, გამოითვლით მის ფართობს.

#დავალება3: შექმენით ფუნქცია, რომელსაც გადასცემთ მართკუთხედის ოთხ გვერდს, გამოითვლით მის პერიმეტრს.

#დავალება4: შექმენით ფუნქცია, რომელიც მიიღებს არგუმენტად სიას და დაბეჭდეთ სიის რიცხვების ჯამი, არ გამოიყენოთ sum.

#დავალება5: შექმენით ფუნქცია, რომელიც დაბეჭდავს კონკრეტული სიიდან მინიმალურ და მაქსიმალურ რიცხვებს, არ გამოიყენოთ min და max. გამოიყენეთ def, for, if/else, indexing, print.

# #1
# def name(num1,num2):
#     print(num1 + num2, num1 - num2, num1 * num2, num1 / num2)

# name (5,10)

# #2
# def name(num1,num2):
#     print(num1 * num2)

# name(5,10)

# #3
# def name(num1,num2,num3,num4):
#     print(num1 + num2 + num3 + num4)

# name(10,12,13,15)

#4
list = [10,20,12,13,15]

def num(list):
    for i in list:
        list = list + 1

num