#'''შექმენით ორი ცვლადი name - password სადაც მომხარებელს შემოატანიებთ სახელს და პაროლს და ასევე შექმენით მესამე ცვლადი repeat_password სადაც თუ მომხმარებელის შეყვანილი პაროლი არ დაემთხვევა პირველად შეყვანილ პაროლს დაუწერეთ რომ პაროლი არასწორია თუარადა დაუწერეთ "თქვენ წარმატებით გაიარეთ რეგისტრაცია" - გამოიყენეთ if - else'''

name = input("თქვენი სახელი")

password = input("თქვენი პაროლი")

repeat_password = input("გაიმეორეთ თქვენი პაროლი")


if password == repeat_password:
    print("თქვენ წარმატებით გაიარეთ რეგისტრაცია")

else:
    print("პაროლი არასწორია")
    
