#დავალება1) შექმენით სია პროგრამირების ენების შესახებ, შეიტანეთ 5 პროგრამირების ენა. დაპრინტეთ  ჯერ მთლიანი სია, შემდეგ კი ბოლო ელემენტი.

program_language = ["java","python","php","javascript","swift"]

print(program_language)
print(program_language[4])

#დავალება2) შექმენით სია, სადაც გექნებათ შეტანილი string, integer, float, boolean. საბოლოოდ ყველა ელემენტი ცალ-ცალკე გამოიტანეთ.

list = ["hello", 2, 0.9, "true"]

print (list[0])
print (list[1])
print (list[2])
print (list[3])

#დავალება3) შექმენით სია, სადაც გექნებათ 0-იდან 20-ის ჩათვლით 4-ის ჯერადები და პრინტით გამოიტანეთ უდიდესი.

list = [0,4,8,12,16,20]

print(list[5])

#დავალება4) შექმენით სია სადაც შეტანილი გექნებათ 30-იდან 50-ის ჩათვლით კენტი რიცხვები. შემდეგ დაპტინტეთ სამი უმცირესი ელემენტის ჯამი.

list = [30,32,34,36,38,40,42,44,46,48,50]

print(list[0] + list[1] + list[2])

#დავალება5) დაპრინტეთ სამის ჯერადები დავალება 4-ის სიიდან.

list = [30,33,36,39,42,45,48,51]

print(list[0] + list[1] + list[2])

